{"author":{"name":"Alexander Soto","type":"card","url":"https://www.alexsoto.dev/"},"content":{"html":"\n\n\u003ch2 id=\"analogy\"\u003eAnalogy\u003c/h2\u003e\n\n\u003cp\u003eChunking is like working through a jigsaw puzzle. You start with separate pieces, as you work on the puzzle, you create small clusters of pieces or chunks, which contain more meaning and further help you complete the puzzle.\u003c/p\u003e\n\n\u003ch2 id=\"diagram-example\"\u003eDiagram/Example\u003c/h2\u003e\n\n\n\n\n\u003cfigure\u003e\n    \n        \u003cimg src=\"https://www.alexsoto.dev/ox-hugo/chunking_2019-10-17_10-47-48.png\"/\u003e \u003c/figure\u003e\n\n\n\u003ch2 id=\"plain-english\"\u003ePlain-English\u003c/h2\u003e\n\n\u003cp\u003eChunking is the process that allows us to connect smaller pieces of information into bigger chunks to help us remember.\u003c/p\u003e\n\n\u003ch2 id=\"technical\"\u003eTechnical\u003c/h2\u003e\n\n\u003cp\u003eChunking is a process by which individual pieces of an information set are broken down and then grouped together. A chunk is a collection of basic familiar units that have been grouped together and stored in a person\u0026rsquo;s memory. These chunks are able to be retrieved more easily due to their coherent familiarity.\u003c/p\u003e\n","text":" Analogy Chunking is like working through a jigsaw puzzle. You start with separate pieces, as you work on the puzzle, you create small clusters of pieces or chunks, which contain more meaning and further help you complete the puzzle.\nDiagram/Example   Plain-English Chunking is the process that allows us to connect smaller pieces of information into bigger chunks to help us remember.\nTechnical Chunking is a process by which individual pieces of an information set are broken down and then grouped together. A chunk is a collection of basic familiar units that have been grouped together and stored in a person\u0026rsquo;s memory. These chunks are able to be retrieved more easily due to their coherent familiarity.\n"},"name":"Chunking","published":"2019-10-17T10:48:00-04:00","summary":"Analogy Chunking is like working through a jigsaw puzzle. You start with separate pieces, as you work on the puzzle, you create small clusters of pieces or chunks, which contain more meaning and further help you complete the puzzle.\nDiagram/Example   Plain-English Chunking is the process that allows us to connect smaller pieces of information into bigger chunks to help us remember.\nTechnical Chunking is a process by which individual pieces of an information set are broken down and then grouped together.","type":"entry","url":"https://www.alexsoto.dev/blog/chunking/"}