{"author":{"name":"Alexander Soto","type":"card","url":"https://www.alexsoto.dev/"},"content":{"html":"\n\n\u003cp\u003eIn my \u003ca href=\"https://alexsoto.dev/blog/full-stack-open/\"\u003eprevious post\u003c/a\u003e I discuss my intention of completing the course \u0026ldquo;\u003ca href=\"https://fullstackopen.com/en/\"\u003eDeep Dive Into Modern Web Development\u003c/a\u003e\u0026rdquo; with the purpose of starting a progressive journey on becoming a software developer. The primary focus of this post is providing a list of sources and learning strategies that are going to be used.\u003c/p\u003e\n\n\u003ch2 id=\"resources\"\u003eResources\u003c/h2\u003e\n\n\u003cp\u003eOver the years in my experience as being both a teacher and a student I have come across different sources that are related to the field of learning. The learning strategies that I\u0026rsquo;m adopting have been informed by the following sources:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://barbaraoakley.com/books/a-mind-for-numbers/\"\u003eA Mind For Numbers: How to Excel at Math and Science\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://pragprog.com/book/ahptl/pragmatic-thinking-and-learning\"\u003ePragmatic Thinking and Learning: Refactor Your Wetware\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"https://www.petercbrown.com/make%5Fit%5Fstick.php\"\u003eMake It Stick: The Science of Successful Learning\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eArticles from \u003ca href=\"https://betterexplained.com/archives/\"\u003eBetter Explained\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eThis is not an exhaustive list by any measure, there are plenty of other discussions about the topic, doing a search on Google yielded over 8 billion possible results.\u003c/p\u003e\n\n\u003cp\u003eThe list here represents resources that I turn to when I need a refresher and have found works best for me.\u003c/p\u003e\n\n\u003cp\u003eThe sources above were chosen for the specific strategies, findings, and thoughts that were presented about learning.\u003c/p\u003e\n\n\u003ch2 id=\"strategies\"\u003eStrategies\u003c/h2\u003e\n\n\u003cp\u003eWhat follows is a list of learning strategies and concepts that were presented in the books and articles listed above.\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eADEPT Method\u003c/li\u003e\n\u003cli\u003eChunking\u003c/li\u003e\n\u003cli\u003eGeneration\u003c/li\u003e\n\u003cli\u003eElaboration\u003c/li\u003e\n\u003cli\u003eRetrieval\u003c/li\u003e\n\u003cli\u003eReflection\u003c/li\u003e\n\u003cli\u003eInterleaving\u003c/li\u003e\n\u003cli\u003eCalibration\u003c/li\u003e\n\u003cli\u003eSpacing\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eIn posts to come I will go deeper into each learning strategy and how I\u0026rsquo;m implementing them into an overall learning plan.\u003c/p\u003e\n","text":" In my previous post I discuss my intention of completing the course \u0026ldquo;Deep Dive Into Modern Web Development\u0026rdquo; with the purpose of starting a progressive journey on becoming a software developer. The primary focus of this post is providing a list of sources and learning strategies that are going to be used.\nResources Over the years in my experience as being both a teacher and a student I have come across different sources that are related to the field of learning. The learning strategies that I\u0026rsquo;m adopting have been informed by the following sources:\n A Mind For Numbers: How to Excel at Math and Science Pragmatic Thinking and Learning: Refactor Your Wetware Make It Stick: The Science of Successful Learning Articles from Better Explained  This is not an exhaustive list by any measure, there are plenty of other discussions about the topic, doing a search on Google yielded over 8 billion possible results.\nThe list here represents resources that I turn to when I need a refresher and have found works best for me.\nThe sources above were chosen for the specific strategies, findings, and thoughts that were presented about learning.\nStrategies What follows is a list of learning strategies and concepts that were presented in the books and articles listed above.\n ADEPT Method Chunking Generation Elaboration Retrieval Reflection Interleaving Calibration Spacing  In posts to come I will go deeper into each learning strategy and how I\u0026rsquo;m implementing them into an overall learning plan.\n"},"name":"Learning strategies","published":"2019-10-16T10:09:00-04:00","summary":"In my previous post I discuss my intention of completing the course \u0026ldquo;Deep Dive Into Modern Web Development\u0026rdquo; with the purpose of starting a progressive journey on becoming a software developer. The primary focus of this post is providing a list of sources and learning strategies that are going to be used.\nResources Over the years in my experience as being both a teacher and a student I have come across different sources that are related to the field of learning.","type":"entry","url":"https://www.alexsoto.dev/blog/learning-strategies/"}