{"author":{"name":"Alexander Soto","type":"card","url":"https://dynamicmetaflow.github.io"},"content":{"html":"\n\n\u003cdiv class=\"ox-hugo-toc toc\"\u003e\n\u003cdiv\u003e\u003c/div\u003e\n\n\u003cdiv class=\"heading\"\u003eTable of Contents\u003c/div\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#blog\"\u003eBlog\u003c/a\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"#ideas\"\u003eIdeas\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#draft\"\u003eDraft\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e\u003ca href=\"#done\"\u003eDone\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003c/div\u003e\n\u003c!--endtoc--\u003e\u003c/p\u003e\n\n\u003ch2 id=\"blog\"\u003eBlog\u003c/h2\u003e\n\n\u003ch3 id=\"ideas\"\u003eIdeas\u003c/h3\u003e\n\n\u003ch4 id=\"ours-to-hack-and-to-own\"\u003eOurs to Hack and to Own\u003c/h4\u003e\n\n\u003ch5 id=\"outline\"\u003eOutline\u003c/h5\u003e\n\n\u003ch6 id=\"discuss-what-the-book-is-about\"\u003eDiscuss what the book is about\u003c/h6\u003e\n\n\u003ch6 id=\"specific-chapters-that-are-of-interest-to-me\"\u003eSpecific chapters that are of interest to me\u003c/h6\u003e\n\n\u003ch4 id=\"book-review-weapons-of-math-destruction-how-big-data-increases-inequality-and-threatens-democracy\"\u003eBook Review - \u003ca href=\"https://www.amazon.com/Weapons-Math-Destruction-Increases-Inequality/dp/0553418815?camp=1789\u0026amp;creative=9325\u0026amp;linkCode=ur2\u0026amp;tag=iphone0dce-20\u0026amp;linkId=OMBRYAX56M45VB35\"\u003eWeapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy\u003c/a\u003e\u003c/h4\u003e\n\n\u003ch5 id=\"background\"\u003eBackground\u003c/h5\u003e\n\n\u003ch5 id=\"draft\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"review-app-discussion\"\u003eReview App Discussion\u003c/h4\u003e\n\n\u003cp\u003e:ID:       79e4f2e2-dd23-41ae-bf93-096bcc580690\u003c/p\u003e\n\n\u003ch6 id=\"https-www-dot-ushahidi-dot-com\"\u003e\u003ca href=\"https://www.ushahidi.com/\"\u003ehttps://www.ushahidi.com/\u003c/a\u003e\u003c/h6\u003e\n\n\u003ch6 id=\"http-tidepools-dot-co\"\u003e\u003ca href=\"http://tidepools.co/\"\u003ehttp://tidepools.co/\u003c/a\u003e\u003c/h6\u003e\n\n\u003ch6 id=\"drewrwilson-toolsforactivism-growing-list-of-digital-tools-for-activism-things-https-github-dot-com-drewrwilson-toolsforactivism\"\u003edrewrwilson/toolsforactivism: growing list of digital tools for activism things \u003ca href=\"https://github.com/drewrwilson/toolsforactivism\"\u003ehttps://github.com/drewrwilson/toolsforactivism\u003c/a\u003e\u003c/h6\u003e\n\n\u003ch6 id=\"unhosted-web-apps-https-unhosted-dot-org\"\u003eunhosted web apps \u003ca href=\"https://unhosted.org/\"\u003ehttps://unhosted.org/\u003c/a\u003e\u003c/h6\u003e\n\n\u003ch6 id=\"usable-project-usable-resources\"\u003e\u003ca href=\"https://usable.tools/resources.html\"\u003eUSABLE Project - Usable Resources\u003c/a\u003e\u003c/h6\u003e\n\n\u003ch5 id=\"draft-1\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"communication-design-https-en-dot-wikipedia-dot-org-wiki-communication-design\"\u003eCommunication Design - \u003ca href=\"https://en.wikipedia.org/wiki/Communication%5Fdesign\"\u003ehttps://en.wikipedia.org/wiki/Communication%5Fdesign\u003c/a\u003e\u003c/h4\u003e\n\n\u003ch6 id=\"discuss-how-this-relates-to-poc-people\"\u003eDiscuss how this relates to POC people\u003c/h6\u003e\n\n\u003ch5 id=\"draft-2\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"loomio-making-decisions-together-https-www-dot-loomio-dot-org\"\u003eLoomio | Making Decisions Together - \u003ca href=\"https://www.loomio.org/\"\u003ehttps://www.loomio.org/\u003c/a\u003e\u003c/h4\u003e\n\n\u003ch5 id=\"background-1\"\u003eBackground\u003c/h5\u003e\n\n\u003ch5 id=\"draft-3\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"app-idea-discussion-community-bank\"\u003eApp Idea Discussion - Community Bank\u003c/h4\u003e\n\n\u003ch5 id=\"idea\"\u003eIdea\u003c/h5\u003e\n\n\u003ch6 id=\"application-of-where-a-local-community-fund-where-people-donate-money-to-a-local-fun-that-people-group-of-people-can-use\"\u003eApplication of where a local community fund where people donate money to a local fun that people group of people can use\u003c/h6\u003e\n\n\u003ch5 id=\"draft-4\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"heat-seek-http-heatseek-dot-org\"\u003eHeat Seek - \u003ca href=\"http://heatseek.org/\"\u003ehttp://heatseek.org/\u003c/a\u003e\u003c/h4\u003e\n\n\u003ch5 id=\"background-2\"\u003eBackground\u003c/h5\u003e\n\n\u003ch5 id=\"draft-5\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"reproducible-builds-for-non-profits\"\u003eReproducible Builds for non-profits\u003c/h4\u003e\n\n\u003ch5 id=\"idea-1\"\u003eIdea\u003c/h5\u003e\n\n\u003ch6 id=\"when-a-protest-movement-is-starting-what-are-the-immediate-needs-of-the-group-and-how-technology-can-to-further-the-goals\"\u003eWhen a protest, movement is starting what are the immediate needs of the group and how technology can to further the goals?\u003c/h6\u003e\n\n\u003ch6 id=\"discussion-of-creating-reproducible-builds-for-non-profits-dot-gnu-guix\"\u003eDiscussion of creating reproducible builds for non-profits. GNU Guix\u003c/h6\u003e\n\n\u003ch5 id=\"draft-6\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"second-year-teaching\"\u003eSecond Year Teaching\u003c/h4\u003e\n\n\u003ch3 id=\"draft-7\"\u003eDraft\u003c/h3\u003e\n\n\u003ch4 id=\"incubate-captcha\"\u003eINCUBATE #*!$, CAPTCHA\u003c/h4\u003e\n\n\u003ch4 id=\"app-idea-discussion-worker-timesheet-application\"\u003eApp Idea Discussion - Worker Timesheet Application\u003c/h4\u003e\n\n\u003ch5 id=\"idea-2\"\u003eIdea\u003c/h5\u003e\n\n\u003ch6 id=\"discuss-experience-as-a-labor-rights-organizer-and-the-application-and-use-of-a-worker-timesheet-application\"\u003eDiscuss experience as a labor rights organizer and the application and use of a worker timesheet application\u003c/h6\u003e\n\n\u003ch6 id=\"ionic\"\u003eIonic\u003c/h6\u003e\n\n\u003ch6 id=\"article-thomas-shared-about-gathering-cell-phone-location-data\"\u003eArticle thomas shared about gathering cell phone location data\u003c/h6\u003e\n\n\u003ch6 id=\"discussion-of-implementation\"\u003eDiscussion of implementation\u003c/h6\u003e\n\n\u003ch6 id=\"strengths-and-weaknesses\"\u003eStrengths and weaknesses\u003c/h6\u003e\n\n\u003ch5 id=\"draft-8\"\u003eDraft\u003c/h5\u003e\n\n\u003ch4 id=\"incubate-january-monthly-update\"\u003eINCUBATE January Monthly Update\u003c/h4\u003e\n\n\u003ch3 id=\"done\"\u003eDone\u003c/h3\u003e\n\n\u003ch4 id=\"accountability\"\u003e\u003cspan class=\"org-todo done DONE\"\u003eDONE\u003c/span\u003e Accountability\u003c/h4\u003e\n\n\u003cp\u003eIn this website, I will document my learning path and my process to hold myself accountable for reaching my goal of attaining my master’s degree in Computer Science.\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eIn the \u003ca href=\"https://dynamicmetaflow.github.io/now/\"\u003eNow section\u003c/a\u003e you can see my objectives for today, this week, month and year.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--listend--\u003e\n\n\u003cul\u003e\n\u003cli\u003eThe \u003ca href=\"https://dynamicmetaflow.github.io/review/\"\u003eReview section\u003c/a\u003e consists of a daily and weekly review, a micro-level look at my day including time stamps and a table with a summary of time spent on a given task.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--listend--\u003e\n\n\u003cul\u003e\n\u003cli\u003eThe \u003ca href=\"https://dynamicmetaflow.github.io/courses/\"\u003eCourses section\u003c/a\u003e will contain courses that I am currently taking or have in the past with links to notes taken on the topics presented in the class.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003c!--listend--\u003e\n\n\u003cul\u003e\n\u003cli\u003eThe \u003ca href=\"https://dynamicmetaflow.github.io/notes/\"\u003eNotes section\u003c/a\u003e consists of my notes taken about a subject matter. The notes will be used to create lessons to be made accessible to a broader audience.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eIf you have any comments or suggestions, please feel free to contact me.\u003c/p\u003e\n\n\u003ch4 id=\"graduate-school\"\u003e\u003cspan class=\"org-todo done DONE\"\u003eDONE\u003c/span\u003e Graduate School\u003c/h4\u003e\n\n\u003cp\u003eI’m a graduate student at Northeastern University’s ALIGN program pursuing a master’s degree in Computer Science. The ALIGN program consists of a series of bridge courses for graduate students who didn’t major in Computer Science in their undergraduate studies. Upon completion of the ALIGN program students begin taking graduate level classes in computer science.\u003c/p\u003e\n\n\u003cp\u003eAttaining a master’s degree in computer science will link my community experience with technology and leverage this knowledge to contribute to the self-development and self-sufficiency of communities of color, as well as to enhance people’s capacities to solve problems. My long-term goal is to create a co-operative of social justice focused technologists, “Technology for Communities”, which specializes in civic technology to assist community organizations by assessing needs, analyzing data and creating solutions. A computer science degree combined with my collective experience as a community organizer will allow me to use technology collaboratively with organizations and individuals to address needs to strengthen communities and amplify our collective voice.\u003c/p\u003e\n\n\u003ch4 id=\"game-over-continue\"\u003e\u003cspan class=\"org-todo done DONE\"\u003eDONE\u003c/span\u003e Game Over! Continue?\u003c/h4\u003e\n\n\u003cp\u003eFrom about 2012 to 2014 I was hospitalized due to my mental health. This period was one of the most painful and challenging times for me in my life: being away from friends, family, and society. I was completely excluded from participating in society both physically and mentally, an outcast. I longed to walk in the city, to see my friends and family, to continue my education and to be involved in a community. Upon my release in 2014, I had to restart my life.\u003c/p\u003e\n\n\u003cp\u003eI reconnected with friends and started volunteering in different non-profits in the Boston area. My efforts in volunteering eventually lead me to the opportunity of being an AmeriCorps member for United Way. I along with others focused on providing services to residents in Lynn, MA. In my year of service, I served at a high school: supporting students and teachers, creating an afterschool program, being a positive role model and providing support and services to the community. Around the same period, I found out about Resilient Coders. I decided to volunteer in their afterschool program that teaches youth from communities in the Boston area how to code. Fast forward to the present, and I have worked for two years as a technology teacher at a high school in Boston and was accepted into Northeastern’s Master’s program in computer science.\u003c/p\u003e\n\n\u003cp\u003eAs a Latino, activist, mental health advocate and technologist, I have learned you must have a systematic understanding of problems and issues that affect organizations, communities, and individuals, to leverage technology as a tool for social change. I am deeply passionate about exploring the use of technology to address the lack of access and inequity in education, health, and unemployment in communities of color.\u003c/p\u003e\n\n\u003ch4 id=\"humble-beginnings\"\u003e\u003cspan class=\"org-todo done DONE\"\u003eDONE\u003c/span\u003e Humble Beginnings\u003c/h4\u003e\n\n\u003cp\u003eMy beginnings with technology start in early childhood. During the weekends I visited my father and spent most of the time with my brother Robinson. Robinson, an electrical engineer from the Dominican Republic, was my mentor and role-model. When I visited during the weekend, I would find my brother taking apart and repairing different devices. I looked forward to spending time with him, and I would ask questions about technology, such as “What is RAM?”, “What are the differences between AMD and Intel?”. As a child, exposure to my brother’s work was a valuable resource that expanded my knowledge, sparked my curiosity and interest in technology. As my skills developed, I later assisted my brother in disassembling computers, running diagnostics, installing and upgrading software.\u003c/p\u003e\n\n\u003cp\u003eI then attended Middle School, and a science professor was discarding a computer. I seized this opportunity and asked if I could have it, the professor donated the desktop to me. This was my first computer. I carried the large desktop up a hill and walked several blocks to my house. I troubleshot the desktop and identified the power supply wasn’t working. I swapped the power supply from an abandoned computer, and voila, I became the proud owner of a Pentium II 233 MHz Desktop Computer.\u003c/p\u003e\n\n\u003cp\u003eThrough this computer and my 56K modem, I had the world’s knowledge at my fingertips. My mind was free to explore my interests unhindered from physical and economic barriers. Having a computer enabled me to excel in my studies compared to my peers who didn’t have access to one. Around the same time, I entered a summer program for Middle School students to take advanced classes and prepare them for high school level work. One of the mentors in the program offered to buy a book from a Barnes and Nobles bookstore. As the years progressed, I learned more about computers, increased my knowledge of technology and about the world.\u003c/p\u003e\n\n\u003cp\u003eFrom my experience, having access to technology or resources, advanced my learning potential. By the time I entered high school, the skills I had gained proved to be invaluable. I credit having access to a computer at a young age and having supportive mentors in shaping my path on being a self-learner. After graduating high school, I entered college to understand the problems that impact my communities, and I majored in Political Science with minors in Philosophy and Latin American Studies.\u003c/p\u003e\n\n\u003ch4 id=\"hello-world\"\u003e\u003cspan class=\"org-todo done DONE\"\u003eDONE\u003c/span\u003e Hello World\u003c/h4\u003e\n\n\u003cp\u003eOver the years after many conversations with friends about niche topics, staying up late at night pondering life on the verge of an existential crisis, we have arrived here… a blog in 2019? Bueno, mejor que nada… This post is titled ‘Hello World’, it symbolizes the first step we take to attempt to communicate with someone or something else while being simultaneously born into a new digital world of our creation.\u003c/p\u003e\n\n\u003cp\u003eI want you to step into my world and I’ll take you with me on this journey of pursuing my master’s degree in Computer Science. I see Computer Science as attaining a new ability to be able to see the world through a computational lens, the opportunity to creatively solve problems and to contribute, create and share knowledge with others.\u003c/p\u003e\n\n\u003cp\u003eThis blog, this world that’s being created will serve as a repository about what I’m currently learning. I intend to share what I’ve learned with others by creating content that’s accessible to a wider audience. As someone who in the past has been deeply involved with community-building as a former community organizer, teacher, and mentor, I seek to bridge technology and social justice. I expect this journey to be filled with moments of joy, tears, and frustration… Pa’lante!\u003c/p\u003e\n","text":"  Table of Contents  Blog  Ideas Draft Done    \nBlog Ideas Ours to Hack and to Own Outline Discuss what the book is about Specific chapters that are of interest to me Book Review - Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy Background Draft Review App Discussion :ID: 79e4f2e2-dd23-41ae-bf93-096bcc580690\nhttps://www.ushahidi.com/ http://tidepools.co/ drewrwilson/toolsforactivism: growing list of digital tools for activism things https://github.com/drewrwilson/toolsforactivism unhosted web apps https://unhosted.org/ USABLE Project - Usable Resources Draft Communication Design - https://en.wikipedia.org/wiki/Communication%5Fdesign Discuss how this relates to POC people Draft Loomio | Making Decisions Together - https://www.loomio.org/ Background Draft App Idea Discussion - Community Bank Idea Application of where a local community fund where people donate money to a local fun that people group of people can use Draft Heat Seek - http://heatseek.org/ Background Draft Reproducible Builds for non-profits Idea When a protest, movement is starting what are the immediate needs of the group and how technology can to further the goals? Discussion of creating reproducible builds for non-profits. GNU Guix Draft Second Year Teaching Draft INCUBATE #*!$, CAPTCHA App Idea Discussion - Worker Timesheet Application Idea Discuss experience as a labor rights organizer and the application and use of a worker timesheet application Ionic Article thomas shared about gathering cell phone location data Discussion of implementation Strengths and weaknesses Draft INCUBATE January Monthly Update Done DONE Accountability In this website, I will document my learning path and my process to hold myself accountable for reaching my goal of attaining my master’s degree in Computer Science.\n In the Now section you can see my objectives for today, this week, month and year.    The Review section consists of a daily and weekly review, a micro-level look at my day including time stamps and a table with a summary of time spent on a given task.    The Courses section will contain courses that I am currently taking or have in the past with links to notes taken on the topics presented in the class.    The Notes section consists of my notes taken about a subject matter. The notes will be used to create lessons to be made accessible to a broader audience.  If you have any comments or suggestions, please feel free to contact me.\nDONE Graduate School I’m a graduate student at Northeastern University’s ALIGN program pursuing a master’s degree in Computer Science. The ALIGN program consists of a series of bridge courses for graduate students who didn’t major in Computer Science in their undergraduate studies. Upon completion of the ALIGN program students begin taking graduate level classes in computer science.\nAttaining a master’s degree in computer science will link my community experience with technology and leverage this knowledge to contribute to the self-development and self-sufficiency of communities of color, as well as to enhance people’s capacities to solve problems. My long-term goal is to create a co-operative of social justice focused technologists, “Technology for Communities”, which specializes in civic technology to assist community organizations by assessing needs, analyzing data and creating solutions. A computer science degree combined with my collective experience as a community organizer will allow me to use technology collaboratively with organizations and individuals to address needs to strengthen communities and amplify our collective voice.\nDONE Game Over! Continue? From about 2012 to 2014 I was hospitalized due to my mental health. This period was one of the most painful and challenging times for me in my life: being away from friends, family, and society. I was completely excluded from participating in society both physically and mentally, an outcast. I longed to walk in the city, to see my friends and family, to continue my education and to be involved in a community. Upon my release in 2014, I had to restart my life.\nI reconnected with friends and started volunteering in different non-profits in the Boston area. My efforts in volunteering eventually lead me to the opportunity of being an AmeriCorps member for United Way. I along with others focused on providing services to residents in Lynn, MA. In my year of service, I served at a high school: supporting students and teachers, creating an afterschool program, being a positive role model and providing support and services to the community. Around the same period, I found out about Resilient Coders. I decided to volunteer in their afterschool program that teaches youth from communities in the Boston area how to code. Fast forward to the present, and I have worked for two years as a technology teacher at a high school in Boston and was accepted into Northeastern’s Master’s program in computer science.\nAs a Latino, activist, mental health advocate and technologist, I have learned you must have a systematic understanding of problems and issues that affect organizations, communities, and individuals, to leverage technology as a tool for social change. I am deeply passionate about exploring the use of technology to address the lack of access and inequity in education, health, and unemployment in communities of color.\nDONE Humble Beginnings My beginnings with technology start in early childhood. During the weekends I visited my father and spent most of the time with my brother Robinson. Robinson, an electrical engineer from the Dominican Republic, was my mentor and role-model. When I visited during the weekend, I would find my brother taking apart and repairing different devices. I looked forward to spending time with him, and I would ask questions about technology, such as “What is RAM?”, “What are the differences between AMD and Intel?”. As a child, exposure to my brother’s work was a valuable resource that expanded my knowledge, sparked my curiosity and interest in technology. As my skills developed, I later assisted my brother in disassembling computers, running diagnostics, installing and upgrading software.\nI then attended Middle School, and a science professor was discarding a computer. I seized this opportunity and asked if I could have it, the professor donated the desktop to me. This was my first computer. I carried the large desktop up a hill and walked several blocks to my house. I troubleshot the desktop and identified the power supply wasn’t working. I swapped the power supply from an abandoned computer, and voila, I became the proud owner of a Pentium II 233 MHz Desktop Computer.\nThrough this computer and my 56K modem, I had the world’s knowledge at my fingertips. My mind was free to explore my interests unhindered from physical and economic barriers. Having a computer enabled me to excel in my studies compared to my peers who didn’t have access to one. Around the same time, I entered a summer program for Middle School students to take advanced classes and prepare them for high school level work. One of the mentors in the program offered to buy a book from a Barnes and Nobles bookstore. As the years progressed, I learned more about computers, increased my knowledge of technology and about the world.\nFrom my experience, having access to technology or resources, advanced my learning potential. By the time I entered high school, the skills I had gained proved to be invaluable. I credit having access to a computer at a young age and having supportive mentors in shaping my path on being a self-learner. After graduating high school, I entered college to understand the problems that impact my communities, and I majored in Political Science with minors in Philosophy and Latin American Studies.\nDONE Hello World Over the years after many conversations with friends about niche topics, staying up late at night pondering life on the verge of an existential crisis, we have arrived here… a blog in 2019? Bueno, mejor que nada… This post is titled ‘Hello World’, it symbolizes the first step we take to attempt to communicate with someone or something else while being simultaneously born into a new digital world of our creation.\nI want you to step into my world and I’ll take you with me on this journey of pursuing my master’s degree in Computer Science. I see Computer Science as attaining a new ability to be able to see the world through a computational lens, the opportunity to creatively solve problems and to contribute, create and share knowledge with others.\nThis blog, this world that’s being created will serve as a repository about what I’m currently learning. I intend to share what I’ve learned with others by creating content that’s accessible to a wider audience. As someone who in the past has been deeply involved with community-building as a former community organizer, teacher, and mentor, I seek to bridge technology and social justice. I expect this journey to be filled with moments of joy, tears, and frustration… Pa’lante!\n"},"name":"","published":"0001-01-01T00:00:00Z","summary":"Table of Contents  Blog  Ideas Draft Done    \nBlog Ideas Ours to Hack and to Own Outline Discuss what the book is about Specific chapters that are of interest to me Book Review - Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy Background Draft Review App Discussion :ID: 79e4f2e2-dd23-41ae-bf93-096bcc580690\nhttps://www.ushahidi.com/ http://tidepools.co/ drewrwilson/toolsforactivism: growing list of digital tools for activism things https://github.","type":"entry","url":"https://dynamicmetaflow.github.io/posts/blog/"}